In [35]:
#Import Libraries
import pandas as pd 
import os 
import csv 
from sqlalchemy import create_engine
from config import db_password
import psycopg2

In [36]:
# 1. Create a DataFrame for the Normalized data
Normalized_df=pd.read_csv('Emission_Normalized_Data.csv')
Normalized_df.head()

,Area_Code,Area,Item_Code,Item,Element_Code,Element,Year,Emission
0,2,Afghanistan,5058,Enteric Fermentation,7225,Emissions (CH4),1990,178.4682
1,2,Afghanistan,5058,Enteric Fermentation,724413,Emissions (CO2eq) from CH4 (AR5),1990,4997.1108
2,2,Afghanistan,5058,Enteric Fermentation,723113,Emissions (CO2eq) (AR5),1990,4997.1108
3,2,Afghanistan,5059,Manure Management,7225,Emissions (CH4),1990,8.5165
4,2,Afghanistan,5059,Manure Management,7230,Emissions (N2O),1990,0.3046

# Create the Country Table DataFrame

In [47]:
Area_df = Normalized_df.drop(["Item_Code", "Item","Element_Code", "Element", "Year", "Emission"], axis=1)
Area_df.head()

   Area_Code         Area
0          2  Afghanistan
1          2  Afghanistan
2          2  Afghanistan
3          2  Afghanistan
4          2  Afghanistan

In [48]:
Area_df.set_index('Area_Code', inplace=True)
Area_df.head()

                  Area
Area_Code
2          Afghanistan
2          Afghanistan
2          Afghanistan
2          Afghanistan
2          Afghanistan

In [49]:
Area_table_df = Area_df.drop_duplicates()
Area_table_df.head()

                     Area
Area_Code
2             Afghanistan
3                 Albania
4                 Algeria
5          American Samoa
6                 Andorra

In [50]:
Area_df.count()

Area    905640
dtype: int64

# Create the Item Table DataFrame

In [51]:
Item_df = Normalized_df.drop(["Area", "Area_Code", "Element_Code", "Element", "Year", "Emission"], axis=1)
Item_df.head()

   Item_Code                  Item
0       5058  Enteric Fermentation
1       5058  Enteric Fermentation
2       5058  Enteric Fermentation
3       5059     Manure Management
4       5059     Manure Management

In [52]:
Item_df.set_index('Item_Code', inplace=True, drop=True)
Item_df.head()

                           Item
Item_Code
5058       Enteric Fermentation
5058       Enteric Fermentation
5058       Enteric Fermentation
5059          Manure Management
5059          Manure Management

In [53]:
Item_df.count()

Item    905640
dtype: int64

In [54]:
Item_df = Item_df.drop_duplicates()
Item_df.head()

                              Item
Item_Code
5058          Enteric Fermentation
5059             Manure Management
5060              Rice Cultivation
5061         Synthetic Fertilizers
5062       Manure applied to Soils

In [55]:
Item_table_df = Item_df.sort_values(by=['Item_Code'])
Item_table_df.head()

                           Item
Item_Code
1707                     LULUCF
1709         Agricultural Soils
1711           IPCC Agriculture
5058       Enteric Fermentation
5059          Manure Management

In [56]:
Item_table_df.count()

Item    25
dtype: int64

# Create the Element Table DataFrame

In [57]:
Element_df = Normalized_df.drop(["Item_Code", "Area", "Area_Code", "Item", "Year", "Emission"], axis=1)
Element_df.head()

   Element_Code                           Element
0          7225                   Emissions (CH4)
1        724413  Emissions (CO2eq) from CH4 (AR5)
2        723113           Emissions (CO2eq) (AR5)
3          7225                   Emissions (CH4)
4          7230                   Emissions (N2O)

In [58]:
Element_df.set_index('Element_Code', inplace=True)
Element_df.head()

                                       Element
Element_Code
7225                           Emissions (CH4)
724413        Emissions (CO2eq) from CH4 (AR5)
723113                 Emissions (CO2eq) (AR5)
7225                           Emissions (CH4)
7230                           Emissions (N2O)

In [59]:
Element_table_df = Element_df.drop_duplicates()
Element_table_df.head()

                                       Element
Element_Code
7225                           Emissions (CH4)
724413        Emissions (CO2eq) from CH4 (AR5)
723113                 Emissions (CO2eq) (AR5)
7230                           Emissions (N2O)
724313        Emissions (CO2eq) from N2O (AR5)

In [60]:
Element_df = Element_df.sort_values(by=['Element_Code'])
Element_df.head()

                      Element
Element_Code
7225          Emissions (CH4)
7225          Emissions (CH4)
7225          Emissions (CH4)
7225          Emissions (CH4)
7225          Emissions (CH4)

In [61]:
Element_table_df.count()

Element    8
dtype: int64

# Create the Emission Table DataFrame

In [62]:
Normalized_df=pd.read_csv('Emission_Normalized_Data.csv', index_col=0)
Normalized_df.head()

,Area,Item_Code,Item,Element_Code,Element,Year,Emission
Area_Code,,,,,,,
2,Afghanistan,5058,Enteric Fermentation,7225,Emissions (CH4),1990,178.4682
2,Afghanistan,5058,Enteric Fermentation,724413,Emissions (CO2eq) from CH4 (AR5),1990,4997.1108
2,Afghanistan,5058,Enteric Fermentation,723113,Emissions (CO2eq) (AR5),1990,4997.1108
2,Afghanistan,5059,Manure Management,7225,Emissions (CH4),1990,8.5165
2,Afghanistan,5059,Manure Management,7230,Emissions (N2O),1990,0.3046

In [63]:
Emission_df = Normalized_df.drop(["Area", "Item", "Element"], axis=1)
Emission_df.head()

           Item_Code  Element_Code  Year   Emission
Area_Code
2               5058          7225  1990   178.4682
2               5058        724413  1990  4997.1108
2               5058        723113  1990  4997.1108
2               5059          7225  1990     8.5165
2               5059          7230  1990     0.3046

In [64]:
Emission_table_df = Emission_df.sort_values(by=['Area_Code', 'Item_Code', 'Element_Code'])
Emission_table_df.head()

           Item_Code  Element_Code  Year  Emission
Area_Code
1               1707          7225  1990    0.0000
1               1707          7225  1991    0.0000
1               1707          7225  1992    0.0204
1               1707          7225  1993    0.0204
1               1707          7225  1994    0.0204

In [65]:
Emission_table_df.count()

Item_Code       905640
Element_Code    905640
Year            905640
Emission        905640
dtype: int64

# Create Database Engine

In [66]:
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/DataAnalyticsProject"
engine = create_engine(db_string)

In [67]:
Country_table_df.to_sql(name='Country', con=engine, if_exists='replace')

In [68]:
Item_table_df.to_sql(name='Item', con=engine, if_exists='replace')

In [69]:
Element_table_df.to_sql(name='Element', con=engine, if_exists='replace')

In [70]:
Emission_table_df.to_sql(name='Emission', con=engine, if_exists='replace')

In [71]:
#Retrieving the table data & metadata from pgadmin to the program
import sqlalchemy as db
metadata = db.MetaData()
emission=db.Table('Emission', metadata, autoload=True, autoload_with=engine)

In [72]:
# Print the column names
print(emission.columns.keys())

['Area_Code', 'Item_Code', 'Element_Code', 'Year', 'Emission']

In [73]:
query = db.select([emission])
Result = engine.execute(query)
ResultSet = Result.fetchall()
ResultSet[:5]

[(1, 1707, 7225, 1990, 0.0),
 (1, 1707, 7225, 1991, 0.0),
 (1, 1707, 7225, 1992, 0.0204),
 (1, 1707, 7225, 1993, 0.0204),
 (1, 1707, 7225, 1994, 0.0204)]

In [74]:
#Moving the results to a data frame
df=pd.DataFrame(ResultSet)
df.head()

   0     1     2     3       4
0  1  1707  7225  1990  0.0000
1  1  1707  7225  1991  0.0000
2  1  1707  7225  1992  0.0204
3  1  1707  7225  1993  0.0204
4  1  1707  7225  1994  0.0204